app/views/tasks/insert.html.erb

</tr>
<% @projects.tasks.each do |i| %>
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`project_id` = 1 LIMIT 1