app/views/projects/multitasks.html.erb

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`project_id` = 1
---
    }
    $.ajax(
      {
        url: "updateajax",
        type: "POST",
        data: $('form').serialize(),
        dataType: "json",
        success: function(data,status){
        var str='';
        if(data.errors)
        {
         len=data.errors.length
          if(len>0)
          {
          str+="<h2>"+len+" errors prohibited to add  Tasks. No tasks added</h2>";
          for(i=0;i<len;i++)
            str+="<li>"+data.errors[i]+"</li>";
          }
        }
        else if(data.success)
        {
           $("form")[0].reset()

SELECT `projects`.* FROM `projects`
---
  <tr><td>Project title</td><td>
  <%= task_form.collection_select(:project_id, Project.all, :id, :title) %></td></tr>