app/views/projects/showtasks.html.erb

<% @projects.each do |project| %>
<% c=project.tasks.count %>
---
SELECT COUNT(*) FROM `tasks` WHERE `tasks`.`project_id` = 1
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`project_id` = 1