app/controllers/projects_controller.rb

  def create
    @project=Project.new(project_params)
    # @project=Project.create(:title=>i["title"],:description=>i[])
    if @project.save
      flash[:notice]="Project Added"
    else
      flash[:notice]="Project Not Added"
    end
   @projects=Project.all
---
SELECT `projects`.* FROM `projects`

  def update
    @tasks=params[:project][:tasks_attributes]
    @tasks.each do |i|
      j = @tasks[i]
      @task=Task.create(
        :project_id => j["project_id"],
        :title=>j["title"],
        :description=>j["description"],
        :hours=>j["hours"]
      )
---
SELECT `projects`.* FROM `projects`
INSERT INTO `projects` (`title`, `description`, `created_at`, `updated_at`) VALUES ('Donald Duck', 'Duckburg', '2018-03-09 07:31:31', '2018-03-09 07:31:31')
INSERT INTO `tasks` (`title`, `description`, `hours`, `taskdate`, `project_id`, `created_at`, `updated_at`) VALUES ('selkg', 'kldrg', 5, '2018-01-11', 1, '2018-02-28 11:08:14', '2018-02-28 11:08:14')