app/controllers/projects_controller.rb

	def show
		@projects=Project.all
---
SELECT `projects`.* FROM `projects`

	def iproject
		@project = Project.new(:title=>params[:title],:description=>params[:description])
		if @project.save
---
INSERT INTO `projects` (`title`, `description`, `created_at`, `updated_at`) VALUES ('oei5tj', 'jonio', '2018-03-09 05:42:58', '2018-03-09 05:42:58')

	def delete
		@project=Project.find(params[:id])
		if @project.destroy
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = NULL LIMIT 1
DELETE FROM `projects` WHERE `projects`.`id` = 3

	def edit
	 @project=Project.find(params[:id])
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1

	def create
		@project = Project.new(project_params)
		if @project.save
---
INSERT INTO `projects` (`title`, `description`, `created_at`, `updated_at`) VALUES ('Online Fruits shopping', 'About Fruits', '2018-02-27 10:12:05', '2018-02-27 10:12:05')

	def showtasks
		@projects=Project.all
---
SELECT `projects`.* FROM `projects`

	def updateproject
		@project=Project.find(params[:project][:id])
		if @project.update_attributes(project_params)
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = NULL LIMIT 1
UPDATE `projects` SET `title` = 'Online Iphone shopping', `updated_at` = '2018-02-28 09:47:19' WHERE `projects`.`id` = 1

	def updateajax
			@tasks=params[:project][:tasks_attributes]
			taskdate=params[:obj][:taskdate]
			sum=0
			@errors=Array.new()
			@t=Array.new()
			flag=false
			@tasks.each do |i|
				j = @tasks[i]
				j.delete("_destroy")
			  @t<<j
				# @t<<{:project_id => j["project_id"],:taskdate=>j["taskdate"], :title=>j["title"],
				# 	:description=>j["description"],:hours=>j["hours"]}
				@task=Task.new(@t.last)
				puts "t = #{@t}"
				unless @task.valid?
					 @task.errors.full_messages.each do |i|
										 @errors<<i
					 end
					 flag=true
					 break
				end
				sum+=j["hours"].to_i
				puts sum
			end
			remaining=8-Task.where(:taskdate => taskdate).sum(:hours)
---
SELECT `projects`.* FROM `projects`
SELECT SUM(`tasks`.`hours`) FROM `tasks` WHERE `tasks`.`taskdate` = '2018-03-06'

				 end
				 if sum > remaining
						if remaining > 0
								 @errors<<"Your Task date #{@taskdate} had only #{remaining} remaining hours"
---
INSERT INTO `tasks` (`title`, `description`, `hours`, `taskdate`, `project_id`, `created_at`, `updated_at`) VALUES ('sret','uig','1','2018-11-15','1','2018-03-12 22:10:35 +0530','2018-03-12 22:10:35 +0530'),('sdr','jygb','2','2018-11-15','1','2018-03-12 22:10:35 +0530','2018-03-12 22:10:35 +0530'),