app/controllers/tasks_controller.rb

  def insert
    @projects=Project.find(params[:id])
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1

  def delete
    @task=Task.find(params[:id])
    if @task.delete
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 3 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 3

  def create
    @task=Task.new(task_params)
    if @task.save
      flash[:notice]="Task Added"
    else
      flash[:notice]="Task not Added"
    end
    @projects=Project.find(params[:project][:id])
---
INSERT INTO `tasks` (`title`, `description`, `hours`, `taskdate`, `project_id`, `created_at`, `updated_at`) VALUES ('asieuffb', 'ibviub', 5.0, '2018-03-15', 16, '2018-03-09 12:10:08', '2018-03-09 12:10:08')
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 16 LIMIT 1

  def update
    @projects=Project.find(params[:project][:id])
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = NULL LIMIT 1